
<!-- terraform-plan-dev -->
### 🌍 Terraform Plan – **DEV**

<details>
<summary>Click to expand</summary>

```terraform
Acquiring state lock. This may take a few moments...
data.aws_eks_cluster_auth.eks: Reading...
data.aws_eks_cluster.eks: Reading...
module.vpc.aws_eip.nat: Refreshing state... [id=eipalloc-0cce5e41bdbc87a3d]
module.vpc.aws_vpc.this: Refreshing state... [id=vpc-03941e8b2d25f3f29]
data.aws_eks_cluster_auth.eks: Read complete after 0s [id=Shared-cluster]
module.vpc.aws_internet_gateway.this: Refreshing state... [id=igw-0ed3230ce3c9f338b]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-03a90a5bde313b897]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-0c8a34911a54a6c74]
module.vpc.aws_subnet.private[2]: Refreshing state... [id=subnet-0475d98ab56c5a428]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-04117bbb5d82ac44e]
module.vpc.aws_subnet.public[2]: Refreshing state... [id=subnet-0c2714b25b607fdd2]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-03474a57401dd96d8]
module.vpc.aws_route_table.public: Refreshing state... [id=rtb-035f5c6cd4b42d4a7]
module.vpc.aws_nat_gateway.this: Refreshing state... [id=nat-03fcc9964b674b655]
module.vpc.aws_route_table.private: Refreshing state... [id=rtb-004add3b718ded441]
module.vpc.aws_route_table_association.public["1"]: Refreshing state... [id=rtbassoc-069faa912545e93bf]
module.vpc.aws_route_table_association.public["2"]: Refreshing state... [id=rtbassoc-0b91f10f2529a4055]
module.vpc.aws_route_table_association.public["0"]: Refreshing state... [id=rtbassoc-077a243c638d09a2f]
module.vpc.aws_route_table_association.private["1"]: Refreshing state... [id=rtbassoc-081f73e9080efc510]
module.vpc.aws_route_table_association.private["0"]: Refreshing state... [id=rtbassoc-0890352860f44c6a2]
module.vpc.aws_route_table_association.private["2"]: Refreshing state... [id=rtbassoc-02926d9def3fda9b4]
module.eks.aws_iam_role.eks_cluster_role: Refreshing state... [id=dev-2-eks-cluster-role]
module.eks.aws_iam_role.node_role: Refreshing state... [id=dev-2-eks-node-role]
module.eks.aws_iam_role_policy_attachment.cluster_policy_attachment: Refreshing state... [id=dev-2-eks-cluster-role-20260316022317124300000004]
module.eks.aws_eks_cluster.this: Refreshing state... [id=Shared-cluster]
module.eks.aws_iam_role_policy_attachment.worker_node_policy: Refreshing state... [id=dev-2-eks-node-role-20260316022317116500000003]
module.eks.aws_iam_role_policy_attachment.cni_policy: Refreshing state... [id=dev-2-eks-node-role-20260316022317057100000002]
module.eks.aws_iam_role_policy_attachment.ecr_policy: Refreshing state... [id=dev-2-eks-node-role-20260316022317049400000001]
module.addons.aws_eks_addon.vpc_cni: Refreshing state... [id=Shared-cluster:vpc-cni]
module.eks.aws_eks_node_group.this: Refreshing state... [id=Shared-cluster:dev-2-eks-node-group]
module.addons.aws_eks_addon.coredns: Refreshing state... [id=Shared-cluster:coredns]
module.eks.aws_security_group_rule.alloow_private_endpoint_access[0]: Refreshing state... [id=sgrule-4103570733]
module.eks.aws_iam_openid_connect_provider.this: Refreshing state... [id=arn:aws:iam::358871393576:oidc-provider/oidc.eks.us-east-1.amazonaws.com/id/71A63A6AC8B180890192071909BC093D]
module.addons.aws_eks_addon.kube_proxy: Refreshing state... [id=Shared-cluster:kube-proxy]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.eks.aws_eks_cluster.this has been deleted
  - resource "aws_eks_cluster" "this" {
      - certificate_authority         = [
          - {
              - data = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSURCVENDQWUyZ0F3SUJBZ0lJUHJ3SHpjYTlwbll3RFFZSktvWklodmNOQVFFTEJRQXdGVEVUTUJFR0ExVUUKQXhNS2EzVmlaWEp1WlhSbGN6QWVGdzB5TmpBek1UWXdNakkxTVRKYUZ3MHpOakF6TVRNd01qTXdNVEphTUJVeApFekFSQmdOVkJBTVRDbXQxWW1WeWJtVjBaWE13Z2dFaU1BMEdDU3FHU0liM0RRRUJBUVVBQTRJQkR3QXdnZ0VLCkFvSUJBUURBOStiaG1xTW91QnJyOG5TUlhiNWNDWDlIbE1zOExtVy9sN1ZkcFJ3WFAvVjZkY0dsd2VudVNlSUgKZmlVbmw2amZXeElabGRvdXV0dmxpTWxBdzlsZDJnc2h0d3ZFckkvMEZiZkdnaUNVOWtZZkVrZTJZWVdONnAybgpybEpManBWaFhRODNLTGtsd0J1STBQWWRQekdaU05QazFhckpCYmp1Y0tlSFIyUnQwKys2OFRMRGU5SW1LZzlPCkE3ZmRTN0FNQ2FXTHdHc0g3U0FpRnZZcm1TTG9USk5WZGNwQWc5amV5bDUxZXg0QUthVXg5ZkU4Vi9ITnRXV2sKZ2g0V0NlWTFGOXo2YkhUNUw2eGpUYkcwcFdYMTBsL3A2QjNvZXVXV3lTS3NYRGJNb2pSOXI4amw1SnYvam5LWgorTXdqM01OQ2pITzZ0bnZISVpmOGdkK2ZFejI5QWdNQkFBR2pXVEJYTUE0R0ExVWREd0VCL3dRRUF3SUNwREFQCkJnTlZIUk1CQWY4RUJUQURBUUgvTUIwR0ExVWREZ1FXQkJRK3E2Rk1MdVhmK05UcTZ2dnNTNUo0YnpBbnNUQVYKQmdOVkhSRUVEakFNZ2dwcmRXSmxjbTVsZEdWek1BMEdDU3FHU0liM0RRRUJDd1VBQTRJQkFRQzB4WURuaEhVVgpuVWhLUmpjbktkSmp6SllaSVQ2elN1RXJqNVlTQjBBUld4d0VKVHRyRUg1V2kvcW81WGFmTVJqUjlvWWtjNkdSCmk5MWdRelp3L1gvd3Z4TUhxK0JJbzhUUCtBbWhYcGlSOXBJWklrZXJ5UDdzdzg5N2JzMnpLNlczUjRMMVhsVmcKOWVwR2ZsTFliTDFXaGloYzlKY2VFamNJdDR3WDQ4SjR2SEx0TGVyeTZxWXBzOFdOaXgxUHhFa1JFaXJFTHMrdQp6aXBlczlIQ0Zvb3ROMFVuaWdlVXVsRFFoR2wyZFh5Ym00MGdPOU0zcDVGdTN2dVp5SURsOFBxeGFBV1VYdDBMCk00dzRkckduWWRpQ1B6b0VFZjNmaDVHSTkvM1BuZmdnTGorZGxyY093eXNmdjlDeVU0eDBCNTEyRTdUdlFCZUQKWFIvMVEra2QxTDBxCi0tLS0tRU5EIENFUlRJRklDQVRFLS0tLS0K"
            },
        ] -> null
      - endpoint                      = "https://71A63A6AC8B180890192071909BC093D.gr7.us-east-1.eks.amazonaws.com" -> null
        id                            = "Shared-cluster"
      - identity                      = [
          - {
              - oidc = [
                  - {
                      - issuer = "https://oidc.eks.us-east-1.amazonaws.com/id/71A63A6AC8B180890192071909BC093D"
                    },
                ]
            },
        ] -> null
      - name                          = "Shared-cluster" -> null
        tags                          = {
            "Name" = "dev-2-eks-cluster"
            "name" = "dev-2"
        }
        # (9 unchanged attributes hidden)

      - vpc_config {
          - cluster_security_group_id = "sg-0b00b3872c068a13a" -> null
            # (6 unchanged attributes hidden)
        }

        # (3 unchanged blocks hidden)
    }

  # module.eks.aws_iam_role.eks_cluster_role has been deleted
  - resource "aws_iam_role" "eks_cluster_role" {
      - arn                   = "arn:aws:iam::358871393576:role/dev-2-eks-cluster-role" -> null
        id                    = "dev-2-eks-cluster-role"
      - name                  = "dev-2-eks-cluster-role" -> null
        tags                  = {}
        # (8 unchanged attributes hidden)
    }

  # module.eks.aws_iam_role.node_role has been deleted
  - resource "aws_iam_role" "node_role" {
      - arn                   = "arn:aws:iam::358871393576:role/dev-2-eks-node-role" -> null
        id                    = "dev-2-eks-node-role"
      - name                  = "dev-2-eks-node-role" -> null
        tags                  = {}
        # (8 unchanged attributes hidden)
    }

  # module.vpc.aws_eip.nat has been deleted
  - resource "aws_eip" "nat" {
      - id                   = "eipalloc-0cce5e41bdbc87a3d" -> null
        tags                 = {}
        # (13 unchanged attributes hidden)
    }

  # module.vpc.aws_internet_gateway.this has been deleted
  - resource "aws_internet_gateway" "this" {
      - id       = "igw-0ed3230ce3c9f338b" -> null
        tags     = {
            "Name" = "dev-2-igw"
        }
        # (4 unchanged attributes hidden)
    }

  # module.vpc.aws_nat_gateway.this has been deleted
  - resource "aws_nat_gateway" "this" {
      - id                                 = "nat-03fcc9964b674b655" -> null
        tags                               = {
            "Name" = "dev-2-nat"
        }
        # (11 unchanged attributes hidden)
    }

  # module.vpc.aws_route_table.private has been deleted
  - resource "aws_route_table" "private" {
      - id               = "rtb-004add3b718ded441" -> null
        tags             = {
            "Name" = "dev-2-private-rt"
        }
        # (6 unchanged attributes hidden)
    }

  # module.vpc.aws_route_table.public has been deleted
  - resource "aws_route_table" "public" {
      - id               = "rtb-035f5c6cd4b42d4a7" -> null
        tags             = {
            "Name" = "dev-2-public-rt"
        }
        # (6 unchanged attributes hidden)
    }

  # module.vpc.aws_subnet.public[0] has been deleted
  - resource "aws_subnet" "public" {
      - id                                             = "subnet-04117bbb5d82ac44e" -> null
        tags                                           = {
            "Name" = "dev-2-public-1"
        }
        # (16 unchanged attributes hidden)
    }

  # module.vpc.aws_vpc.this has been deleted
  - resource "aws_vpc" "this" {
      - id                                   = "vpc-03941e8b2d25f3f29" -> null
        tags                                 = {
            "Name" = "dev-2-vpc"
            "name" = "dev-2"
        }
        # (15 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement
 <= read (data resources)

Terraform planned the following actions, but then encountered a problem:

  # module.addons.aws_eks_addon.coredns will be created
  + resource "aws_eks_addon" "coredns" {
      + addon_name                  = "coredns"
      + addon_version               = "v1.12.4-eksbuild.1"
      + arn                         = (known after apply)
      + cluster_name                = "Shared-cluster"
      + configuration_values        = (known after apply)
      + created_at                  = (known after apply)
      + id                          = (known after apply)
      + modified_at                 = (known after apply)
      + resolve_conflicts_on_create = "OVERWRITE"
      + resolve_conflicts_on_update = "OVERWRITE"
      + tags_all                    = (known after apply)
    }

  # module.addons.aws_eks_addon.kube_proxy will be created
  + resource "aws_eks_addon" "kube_proxy" {
      + addon_name                  = "kube-proxy"
      + addon_version               = "v1.34.1-eksbuild.2"
      + arn                         = (known after apply)
      + cluster_name                = "Shared-cluster"
      + configuration_values        = (known after apply)
      + created_at                  = (known after apply)
      + id                          = (known after apply)
      + modified_at                 = (known after apply)
      + resolve_conflicts_on_create = "OVERWRITE"
      + resolve_conflicts_on_update = "OVERWRITE"
      + tags_all                    = (known after apply)
    }

  # module.addons.aws_eks_addon.vpc_cni will be created
  + resource "aws_eks_addon" "vpc_cni" {
      + addon_name                  = "vpc-cni"
      + addon_version               = "v1.20.3-eksbuild.1"
      + arn                         = (known after apply)
      + cluster_name                = "Shared-cluster"
      + configuration_values        = (known after apply)
      + created_at                  = (known after apply)
      + id                          = (known after apply)
      + modified_at                 = (known after apply)
      + resolve_conflicts_on_create = "OVERWRITE"
      + resolve_conflicts_on_update = "OVERWRITE"
      + tags_all                    = (known after apply)
    }

  # module.eks.data.tls_certificate.eks will be read during apply
  # (config refers to values not yet known)
 <= data "tls_certificate" "eks" {
      + certificates = (known after apply)
      + id           = (known after apply)
      + url          = (known after apply)
    }

  # module.eks.aws_eks_cluster.this will be created
  + resource "aws_eks_cluster" "this" {
      + arn                           = (known after apply)
      + bootstrap_self_managed_addons = true
      + certificate_authority         = (known after apply)
      + cluster_id                    = (known after apply)
      + created_at                    = (known after apply)
      + endpoint                      = (known after apply)
      + id                            = (known after apply)
      + identity                      = (known after apply)
      + name                          = "Shared-cluster"
      + platform_version              = (known after apply)
      + role_arn                      = (known after apply)
      + status                        = (known after apply)
      + tags                          = {
          + "Name" = "dev-1-eks-cluster"
          + "name" = "dev-1"
        }
      + tags_all                      = {
          + "Name" = "dev-1-eks-cluster"
          + "name" = "dev-1"
        }
      + version                       = "1.34"

      + access_config {
          + authentication_mode = "API_AND_CONFIG_MAP"
        }

      + vpc_config {
          + cluster_security_group_id = (known after apply)
          + endpoint_private_access   = false
          + endpoint_public_access    = true
          + public_access_cidrs       = (known after apply)
          + subnet_ids                = (known after apply)
          + vpc_id                    = (known after apply)
        }
    }

  # module.eks.aws_eks_node_group.this will be created
  + resource "aws_eks_node_group" "this" {
      + ami_type               = (known after apply)
      + arn                    = (known after apply)
      + capacity_type          = "ON_DEMAND"
      + cluster_name           = "Shared-cluster"
      + disk_size              = (known after apply)
      + id                     = (known after apply)
      + instance_types         = [
          + "t3.small",
        ]
      + node_group_name        = "dev-1-eks-node-group"
      + node_group_name_prefix = (known after apply)
      + node_role_arn          = (known after apply)
      + release_version        = (known after apply)
      + resources              = (known after apply)
      + status                 = (known after apply)
      + subnet_ids             = (known after apply)
      + tags                   = {
          + "Name" = "dev-1-eks-node-group"
          + "name" = "dev-1"
        }
      + tags_all               = {
          + "Name" = "dev-1-eks-node-group"
          + "name" = "dev-1"
        }
      + version                = (known after apply)

      + scaling_config {
          + desired_size = 3
          + max_size     = 6
          + min_size     = 2
        }
    }

  # module.eks.aws_iam_openid_connect_provider.this must be replaced
-/+ resource "aws_iam_openid_connect_provider" "this" {
      ~ arn             = "arn:aws:iam::358871393576:oidc-provider/oidc.eks.us-east-1.amazonaws.com/id/71A63A6AC8B180890192071909BC093D" -> (known after apply)
      ~ id              = "arn:aws:iam::358871393576:oidc-provider/oidc.eks.us-east-1.amazonaws.com/id/71A63A6AC8B180890192071909BC093D" -> (known after apply)
      - tags            = {} -> null
      ~ tags_all        = {} -> (known after apply)
      ~ thumbprint_list = [
          - "06b25927c42a721631c1efd9431e648fa62e1e39",
        ] -> (known after apply)
      ~ url             = "oidc.eks.us-east-1.amazonaws.com/id/71A63A6AC8B180890192071909BC093D" # forces replacement -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.eks.aws_iam_role.eks_cluster_role will be created
  + resource "aws_iam_role" "eks_cluster_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "eks.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "dev-1-eks-cluster-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # module.eks.aws_iam_role.node_role will be created
  + resource "aws_iam_role" "node_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "dev-1-eks-node-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # module.eks.aws_iam_role_policy_attachment.cluster_policy_attachment will be created
  + resource "aws_iam_role_policy_attachment" "cluster_policy_attachment" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSClusterPolicy"
      + role       = "dev-1-eks-cluster-role"
    }

  # module.eks.aws_iam_role_policy_attachment.cni_policy will be created
  + resource "aws_iam_role_policy_attachment" "cni_policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"
      + role       = "dev-1-eks-node-role"
    }

  # module.eks.aws_iam_role_policy_attachment.ecr_policy will be created
  + resource "aws_iam_role_policy_attachment" "ecr_policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"
      + role       = "dev-1-eks-node-role"
    }

  # module.eks.aws_iam_role_policy_attachment.worker_node_policy will be created
  + resource "aws_iam_role_policy_attachment" "worker_node_policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy"
      + role       = "dev-1-eks-node-role"
    }

  # module.eks.aws_security_group_rule.alloow_private_endpoint_access[0] will be created
  + resource "aws_security_group_rule" "alloow_private_endpoint_access" {
      + cidr_blocks              = [
          + "12.0.0.0/16",
        ]
      + description              = "Allow access to EKS cluster endpoint from allowed CIDR blocks"
      + from_port                = 443
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "ingress"
    }

  # module.vpc.aws_eip.nat will be created
  + resource "aws_eip" "nat" {
      + allocation_id        = (known after apply)
      + arn                  = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = "vpc"
      + id                   = (known after apply)
      + instance             = (known after apply)
      + ipam_pool_id         = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + ptr_record           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags_all             = (known after apply)
      + vpc                  = (known after apply)
    }

  # module.vpc.aws_internet_gateway.this will be created
  + resource "aws_internet_gateway" "this" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Name" = "dev-1-igw"
        }
      + tags_all = {
          + "Name" = "dev-1-igw"
        }
      + vpc_id   = (known after apply)
    }

  # module.vpc.aws_nat_gateway.this will be created
  + resource "aws_nat_gateway" "this" {
      + allocation_id                      = (known after apply)
      + association_id                     = (known after apply)
      + connectivity_type                  = "public"
      + id                                 = (known after apply)
      + network_interface_id               = (known after apply)
      + private_ip                         = (known after apply)
      + public_ip                          = (known after apply)
      + secondary_private_ip_address_count = (known after apply)
      + secondary_private_ip_addresses     = (known after apply)
      + subnet_id                          = (known after apply)
      + tags                               = {
          + "Name" = "dev-1-nat"
        }
      + tags_all                           = {
          + "Name" = "dev-1-nat"
        }
    }

  # module.vpc.aws_route_table.private will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = [
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = "0.0.0.0/0"
              + core_network_arn           = ""
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = (known after apply)
              + ipv6_cidr_block            = ""
              + local_gateway_id           = ""
              + nat_gateway_id             = ""
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
        ]
      + tags             = {
          + "Name" = "dev-1-private-rt"
        }
      + tags_all         = {
          + "Name" = "dev-1-private-rt"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc.aws_route_table.public will be created
  + resource "aws_route_table" "public" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = [
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = "0.0.0.0/0"
              + core_network_arn           = ""
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = (known after apply)
              + ipv6_cidr_block            = ""
              + local_gateway_id           = ""
              + nat_gateway_id             = ""
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
        ]
      + tags             = {
          + "Name" = "dev-1-public-rt"
        }
      + tags_all         = {
          + "Name" = "dev-1-public-rt"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc.aws_route_table_association.private["0"] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.private["1"] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.private["2"] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.public["0"] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.public["1"] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.public["2"] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_subnet.private[0] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "12.0.11.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "dev-1-private-1"
        }
      + tags_all                                       = {
          + "Name" = "dev-1-private-1"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.private[1] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "12.0.12.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "dev-1-private-2"
        }
      + tags_all                                       = {
          + "Name" = "dev-1-private-2"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.private[2] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "12.0.13.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "dev-1-private-3"
        }
      + tags_all                                       = {
          + "Name" = "dev-1-private-3"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.public[0] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "12.0.1.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "dev-1-public-1"
        }
      + tags_all                                       = {
          + "Name" = "dev-1-public-1"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.public[1] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "12.0.2.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "dev-1-public-2"
        }
      + tags_all                                       = {
          + "Name" = "dev-1-public-2"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.public[2] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "12.0.3.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "dev-1-public-3"
        }
      + tags_all                                       = {
          + "Name" = "dev-1-public-3"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_vpc.this will be created
  + resource "aws_vpc" "this" {
      + arn                                  = (known after apply)
      + cidr_block                           = "12.0.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_dns_hostnames                 = true
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "Name" = "dev-1-vpc"
          + "name" = "dev-1"
        }
      + tags_all                             = {
          + "Name" = "dev-1-vpc"
          + "name" = "dev-1"
        }
    }

Plan: 31 to add, 0 to change, 1 to destroy.

Changes to Outputs:
  ~ aws_vpc            = "vpc-03941e8b2d25f3f29" -> (known after apply)
  ~ private_subnet_ids = [
      - "subnet-03474a57401dd96d8",
      - "subnet-0c8a34911a54a6c74",
      - "subnet-0475d98ab56c5a428",
      + (known after apply),
      + (known after apply),
      + (known after apply),
    ]

Warning: Failed to decode resource from state

Error decoding "module.argocd.helm_release.argocd" from prior state: missing
expected {
::error::Terraform exited with code 1.

```

</details>
